[
    ***REMOVED***
        "Character": "banjoandkazooie",
        "Color": "#AF6348",
        "Document": null,
        "LosingStages": "\r\nLylat Cruise\r\nKalos\r\nTown & City",
        "NeutralStages": "...",
        "Other": null,
        "PrimaryNotes": "- Use pills carefully, because Banjo has a better projectile game than Doc\r\n- Counterpressure Banjo’s general campy playstyle by using cape\r\n- D-Throw leads into kill confirms at high percents (U-Tilt and USmash), but U-Tilt whiffs if you don’t mash quick enough\r\n- Banjo uses F-Tilt as a in neutral, which we have to respect because we can’t punish it on block\r\n- He doesn’t have the best OoS options, but beware of grabs\r\n- Banjo’s aerials have a lot of landing lag, except for F-Air\r\n- Edgeguard Banjo with N-Air or Down B while he recovers low",
        "SecondaryNotes": null,
        "TertiaryNotes": null,
        "Title": "Banjo & Kazooie",
        "Video": "[Dr. Mario vs. Banjo & Kazooie Matchup Playlist](https://www.youtube.com/playlist?list=PLaVVi_TueS9wbQk01GC_CHV-oUTG3_fIE)",
        "WinningStages": "\r\nFinal Destination\r\nBattlefield\r\nYoshi's Story\r\nSmashville"
  ***REMOVED***,
    ***REMOVED***
        "Character": "bayonetta",
        "Color": "#1854A4",
        "Document": null,
        "LosingStages": "\r\nBattlefield\r\nYoshi's Story\r\nLylat Cruise\r\nTown & City",
        "NeutralStages": "...",
        "Other": null,
        "PrimaryNotes": "- Abuse your shield options, seriously, hardshielding is a nightmare for Bayo and Doc has one of the best O.O.S. options in the game\r\n- Play patient, she looks for people to jump as her bait & punish game is what she's basically built around\r\n- Don't shield too predictable and mix it up with your movement options\r\n- Do not use pills, especially up close, since that will be a free opening for her\r\n- Try to recover low if possible and watch out for stage spikes\r\n- Bayo's combos can be escaped by SDI; SDI down and away is usually the way to go",
        "SecondaryNotes": null,
        "TertiaryNotes": null,
        "Title": "Bayonetta",
        "Video": "[Dr. Mario vs. Bayonetta Matchup Playlist](https://www.youtube.com/playlist?list=PLaVVi_TueS9z8xwkTrPWdDwqIBv16Fc6w)",
        "WinningStages": "\r\nFinal Destination\r\nSmashville"
  ***REMOVED***,
    ***REMOVED***
        "Character": "bowser",
        "Color": "#FFE0A2",
        "Document": null,
        "LosingStages": "\r\nBattlefield\r\nYoshi's Story\r\nLylat Cruise\r\nSmashville",
        "NeutralStages": "...",
        "Other": null,
        "PrimaryNotes": "- Pills are great in neutral, but respect his range; his attacks might go through pills\r\n- Bowser is very susceptible to combos since he doesnt have any quick reversal options\r\n- Respect his Up B and Side B OoS\r\n- Dash Attack kill catch Bowsers ledge snap consistently, which allows for further edgeguard sequences\r\n- Bowsers U-Tilt can cover ledge climb, ledge jump, ledge roll as well as ledge drop pill, since it covers an insane amount of space and is able to armor through pill with tilt attacks\r\n- Bowser tries to interrupt Doc’s recovery with F-Air, so pick your recovery route carefully\r\n- Avoid his Side B near ledge once Bowser has the lead, drift towards the stage so he doesn‘t take you down with him\r\n- Docs U-Tilt works well against Bowser because he’s the heaviest character in the game without quick reversal options\r\n- D-Throw > Down B also works well due to Bowsers weight",
        "SecondaryNotes": null,
        "TertiaryNotes": null,
        "Title": "Bowser",
        "Video": "[Dr. Mario vs. Bowser Matchup Playlist](https://www.youtube.com/playlist?list=PLaVVi_TueS9xHVpjzIDCBoa-dE1MtwTPS)",
        "WinningStages": "\r\nFinal Destination\r\nPokemon Stadium 2"
  ***REMOVED***,
    ***REMOVED***
        "Character": "bowserjr",
        "Color": "#FFE0A2",
        "Document": null,
        "LosingStages": "\r\nTown & City\r\nKalos",
        "NeutralStages": "...",
        "Other": null,
        "PrimaryNotes": "- Prevent Bowser Jr. from setting up his wall by consistently keeping his projectiles incapacitated and putting him in juggle situations while retaining stage control through pills\r\n- Shield against Mechakoopa at a distance. The item will jump up and de-activate, so you can drop shield and pick it up with no risk\r\n- Doc has several ways to deal with Clown Cart in neutral:\r\n\t- Stuff it with a hitbox (i.e. B-Air, pills)\r\n\t- Jump to avoid it, or jump to land with an aerial\r\n\t- Shielding (the weakest option because you're vulnerable to a lot of mix-ups\r\n- When edgeguarding him, don’t commit too hard as BJR has more options to mix-up then someone might think. Once he uses Up-B, make sure to cover as many options as possible with N-Air\r\n- BJR players like to Up-B, purposefully not grab ledge, airdodge and drift behind you, and hammer swing. They don’t do it often, but make sure that you’re prepared for it",
        "SecondaryNotes": null,
        "TertiaryNotes": null,
        "Title": "Bowser Jr.",
        "Video": "[Dr. Mario vs. Bowser Jr. Matchup Playlist](https://www.youtube.com/playlist?list=PLaVVi_TueS9zBxVSrRVKaD8XnaERYoTWj)",
        "WinningStages": "\r\nBattlefield\r\nYoshi's Story\r\nLylat Cruise"
  ***REMOVED***,
    ***REMOVED***
        "Character": "byleth",
        "Color": "#286478",
        "Document": null,
        "LosingStages": "\r\nBattlefield\r\nYoshi's Story\r\nSmall Battlefield",
        "NeutralStages": "...",
        "Other": null,
        "PrimaryNotes": "- Use pills for pressure in neutral\r\n- Always remember to play around the landing hit of N-Air in order to punish OoS\r\n- Cape their arrow for free counterpressure\r\n- Byleth‘s attacks have ridiculous range, but are still punishable\r\n- Don’t jump in at all times, Byleth has great anti air tools\r\n- Byleth doesnt have great options to mash out of disadvantage, so play it safe\r\n- Byleth tries to keep Doc out with Tilts and N-Air, F-Air, B-Air\r\n- Execute with caution at ledge, since Byleth opts to keep you there",
        "SecondaryNotes": null,
        "TertiaryNotes": null,
        "Title": "Byleth",
        "Video": "[Dr. Mario vs. Byleth Matchup Playlist](https://www.youtube.com/playlist?list=PLaVVi_TueS9yL-zQkYtervCLc_lWj9vwa)",
        "WinningStages": "\r\nFinal Destination\r\nSmashville"
  ***REMOVED***,
    ***REMOVED***
        "Character": "captainfalcon",
        "Color": "#D84137",
        "Document": null,
        "LosingStages": "\r\nKalos\r\nSmashville\r\nLylat Cruise",
        "NeutralStages": "...",
        "Other": null,
        "PrimaryNotes": "- Pill is great in neutral to keep Falcon busy\r\n- Falcon has a lot of edgeguard potential, so holding center stage improves your ability to live longer\r\n- Late F-Air is active for a long time and can interrupt your movement offstage very well\r\n- Punish Raptor Boost with your uperior OoS game\r\n- Falcon doesnt have the quickest reversal options, so make good use of throws, D-Tilt as well as U-Air strings\r\n- Try to intercept Falcon with Docs quick aerials before he is able to do a landing aerial\r\n- Grabs also give Falcon a lot of opportunities for combos, so don't overshield\r\n- As Doc, try to interrupt Falcon’s quick movement with lingering hitboxes or try to bait out an option",
        "SecondaryNotes": null,
        "TertiaryNotes": null,
        "Title": "Captain Falcon",
        "Video": "[Dr. Mario vs. Captain Falcon Matchup Playlist](https://www.youtube.com/playlist?list=PLaVVi_TueS9wPPr98-d2r0YEZNSNj5vAF)",
        "WinningStages": "\r\nSmall Battlefield\r\nPokemon Stadium 2"
  ***REMOVED***,
    ***REMOVED***
        "Character": "cloud",
        "Color": "#D8D17C",
        "Document": null,
        "LosingStages": "\r\nBattlefield\r\nYoshi's Story\r\nLylat Cruise",
        "NeutralStages": "...",
        "Other": null,
        "PrimaryNotes": "- Pills are great to control space, but still punishable\r\n- Respect Clouds Up-B at low percent and U-Smash at high percent\r\n- Cloud wants to wall with F-Air and B-Air, so look carefully at their movement to punish incorrect spacing or misjudged timings\r\n- Always be ready for cross slash and cross slash mixups, like stagger or follow ups offstage\r\n- Once Cloud has Limit, be ready to reflect his powered up Neutral B since Cloud doesn’t want it to go to waste",
        "SecondaryNotes": null,
        "TertiaryNotes": null,
        "Title": "Cloud",
        "Video": "[Dr. Mario vs. Cloud Matchup Playlist](https://www.youtube.com/playlist?list=PLaVVi_TueS9z8_D6GvvOU9vUFEkDuP-7t)",
        "WinningStages": "\r\nFinal Destination\r\nSmashville"
  ***REMOVED***,
    ***REMOVED***
        "Character": "corrin",
        "Color": "#E2D8D7",
        "Document": null,
        "LosingStages": "\r\nBattlefield\r\nYoshi's Story\r\nLylat Cruise\r\nSmashville",
        "NeutralStages": "...",
        "Other": null,
        "PrimaryNotes": "- Doc wants to space himself correctly so that he can carefully opt for a punish on Corrin’s landings and attacks in neutral while respecting her moves\r\n- Avoid getting on platforms if possible, Corrin can pressure us there quite well and potentially start a juggle situation\r\n- Don't use pills up close, they can easily be neglected by Corrin's aerials\r\n- Don't try to edgeguard her unless you have a read, her Up-B beats N-Air and Tornado out\r\n- Try not to use shield too often, as Corrin has tools like Side-B to deal with it",
        "SecondaryNotes": null,
        "TertiaryNotes": null,
        "Title": "Corrin",
        "Video": "[Dr. Mario vs. Corrin Matchup Playlist](https://www.youtube.com/playlist?list=PLaVVi_TueS9wkiA1vjRvLleMSDeBhhcSA)",
        "WinningStages": "\r\nFinal Destination\r\nPokemon Stadium 2\r\nTown & City"
  ***REMOVED***,
    ***REMOVED***
        "Character": "pit",
        "Color": "#fffdd0",
        "Document": null,
        "LosingStages": "\r\nBattlefield\r\nYoshi's Story\r\nLylat Cruise\r\nKalos",
        "NeutralStages": "...",
        "Other": null,
        "PrimaryNotes": "- Pills can get reflected as well as deflected, but are still useful for midrange control\r\n- Palutena’s Bow is great to interrupt aerial momentum and setup edgeguard opportunities\r\n- Has many combo starters at all percent\r\n- Prefer DI in on combos, since DI out leads to B-Air, which will force us to play disadvantage offstage\r\n- Don’t overshield, since Side B deals a ton of shield damage\r\n- After an aerial Side B connects, Pit is able to drift away, so don‘t punish preemptively",
        "SecondaryNotes": "- Pills can get reflected as well as deflected, but are still useful for midrange control\r\n- Silver Bow can be reflected for a good chunk of damage\r\n- Has many combo starters at all percent\r\n- Prefer DI in on combos, since DI out leads to B-Air, which will force us to play disadvantage offstage\r\n- If you plan to use shield a lot be wary of Side B, since it deals a ton of shield damage\r\n- After an aerial Side B connects, Pit is able to drift away, so don‘t punish preemptively\r\n- Able to edgeguard well with aerials, arrow can force a stock near the blastzone",
        "TertiaryNotes": null,
        "Title": "(Dark) Pit",
        "Video": "[Dr. Mario vs. (Dark) Pit Matchup Playlist](https://www.youtube.com/playlist?list=PLaVVi_TueS9zw-xkYznjGl2WrkVm2iTd4)",
        "WinningStages": "\r\nFinal Destination\r\nPokemon Stadium 2\r\nSmashville"
  ***REMOVED***,
    ***REMOVED***
        "Character": "samus",
        "Color": "#E42E29",
        "Document": null,
        "LosingStages": "\r\nBattlefield\r\nYoshi's Story\r\nLylat Cruise",
        "NeutralStages": "...",
        "Other": null,
        "PrimaryNotes": "- Be careful with run-up shield; mix up your approaches\r\n- You don't have to approach her every time she charges up\r\n- Don't build your gameplan around reflecting her projectiles\r\n- Don't throw unsafe moves on her, especially vertically since she will be able to Up-B out of shield (frame 4)\r\n- Once she's in the corner, wall her out with B-Air",
        "SecondaryNotes": null,
        "TertiaryNotes": null,
        "Title": "(Dark) Samus",
        "Video": "[Dr. Mario vs. (Dark) Samus Matchup Playlist](https://www.youtube.com/playlist?list=PLaVVi_TueS9wqELS-FqmNYa_42SUAMXdJ)",
        "WinningStages": "\r\nFinal Destination\r\nSmashville"
  ***REMOVED***,
    ***REMOVED***
        "Character": "diddykong",
        "Color": "#F8C284",
        "Document": null,
        "LosingStages": "\r\nSmall Battlefield\r\nLylat Cruise\r\nKalos",
        "NeutralStages": "...",
        "Other": null,
        "PrimaryNotes": "- Banana is Diddy's main tool, try to play around it\r\n- Expect him to:\r\n\t- Shield with a banana in hand\r\n\t- Throw banana directly at you for a grab\r\n\t- Mix up approaches with Side-B, so don't overuse shield\r\n- Pills are good vs. Diddy since he doesn't have a tool to clank with them, except F-Air, which isn't safe on shield however\r\n- Doc's dash attack is a good option to mix up your approach, since it will also catch banana on the ground- Doc himself can get good punishes off of banana, be creative with it",
        "SecondaryNotes": null,
        "TertiaryNotes": null,
        "Title": "Diddy Kong",
        "Video": "[Dr. Mario vs. Diddy Kong Matchup Playlist](https://www.youtube.com/playlist?list=PLaVVi_TueS9yRRaEDc1dZBvvJ7mEpAfJY)",
        "WinningStages": "\r\nBattlefield\r\nYoshi's Story"
  ***REMOVED***,
    ***REMOVED***
        "Character": "donkeykong",
        "Color": "#7E3C19",
        "Document": null,
        "LosingStages": "\r\nSmall Battlefield\r\nPokemon Stadium 2\r\nSmashville",
        "NeutralStages": "...",
        "Other": null,
        "PrimaryNotes": "- Doc wants to harass DK with pills or try to pressure him with cross-up aerials\r\n- Don’t overuse your shield, because DK can break it easily\r\n- Watch out for DK’s spike attacks because he has trouble recovering vertically; Doc’s options in disadvantage are limited, so don’t get predictable and try to force a situation you will be able to recover from\r\n- Doc is able to edgeguard DK easily with Cape, Dr. Tornado, N-Air and D-Air",
        "SecondaryNotes": null,
        "TertiaryNotes": null,
        "Title": "Donkey Kong",
        "Video": "[Dr. Mario vs. Donkey Kong Matchup Playlist](https://www.youtube.com/playlist?list=PLaVVi_TueS9zy2wnjJzzOredXr4Pw5Trf)",
        "WinningStages": "\r\nFinal Destination\r\nBattlefield"
  ***REMOVED***,
    ***REMOVED***
        "Character": "duckhunt",
        "Color": "#C96A3A",
        "Document": null,
        "LosingStages": "\r\nKalos\r\nTown & City",
        "NeutralStages": "...",
        "Other": null,
        "PrimaryNotes": "- Like most projectile characters, he will react to how you deal with projectiles. Mix up the way you deal with it\r\n- His best neutral tool is can; don't overuse shield or otherwise he will grab you\r\n- Cape and pills are really good in this matchup since it'll change the direction of can; say if you're both on right side and can goes left, that's really good for DH's opponent so abuse it\r\n- He has struggle killing so try to avoid being in his Smash attack range at higher percents, that way he has to choose more risky options to get the finish\r\n- If you shield can at point blank range, it'll hit only him",
        "SecondaryNotes": null,
        "TertiaryNotes": null,
        "Title": "Duck Hunt",
        "Video": "[Dr. Mario vs. Duck Hunt Matchup Playlist](https://www.youtube.com/playlist?list=PLaVVi_TueS9ynCnnmrhdnHZcDio9aZ0Ss)",
        "WinningStages": "\r\nBattlefield\r\nYoshi's Story\r\nSmashville\r\nSmall Battlefield"
  ***REMOVED***,
    ***REMOVED***
        "Character": "falco",
        "Color": "#004DB8",
        "Document": null,
        "LosingStages": "\r\nBattlefield\r\nYoshi's Story\r\nSmall Battlefield",
        "NeutralStages": "...",
        "Other": null,
        "PrimaryNotes": "- Don’t use pills in neutral, since Falco has a reflector that deals additional damage on contact\r\n- Use anti-airs more often to catch Falco in the air\r\n- Block the landing hit of F-Air before you you attempt to punish with an OoS option\r\n- Expect Falco to use U-Tilt a lot, a multihit attack that will also hit opponents on the floor and leads to quick damage\r\n- Avoid platforms at all costs, since Falco benefits a lot from them",
        "SecondaryNotes": null,
        "TertiaryNotes": null,
        "Title": "Falco",
        "Video": "[Dr. Mario vs. Falco Matchup Playlist](https://www.youtube.com/playlist?list=PLaVVi_TueS9xj3OLbybbz0c6b32B32XRU)",
        "WinningStages": "\r\nFinal Destination\r\nPokemon Stadium 2"
  ***REMOVED***,
    ***REMOVED***
        "Character": "fox",
        "Color": "#E9BA6A",
        "Document": null,
        "LosingStages": "\r\nBattlefield\r\nYoshi's Story\r\nSmall Battlefield",
        "NeutralStages": "...",
        "Other": null,
        "PrimaryNotes": "- Don’t use pills in neutral, since Fox has a reflector\r\n- Try to rely on your OoS game, because Fox often tries an aerial approach or burst options like Dash Attack\r\n- Respect Fox’s U-Smash OoS\r\n- Avoid platforms, since Fox can U-Air juggle for a lot of damage\r\n- It’s fine to use shield a lot because Fox doesn’t get too much of off grabs, but you don’t want to lose a stock to Fox’s edgeguarding",
        "SecondaryNotes": null,
        "TertiaryNotes": null,
        "Title": "Fox",
        "Video": "[Dr. Mario vs. Fox Matchup Playlist](https://www.youtube.com/playlist?list=PLaVVi_TueS9zv7Jo2wZzrn6LUZTlSsRU7)",
        "WinningStages": "\r\nFinal Destination\r\nPokemon Stadium 2"
  ***REMOVED***,
    ***REMOVED***
        "Character": "ganondorf",
        "Color": "#A9A977",
        "Document": null,
        "LosingStages": "\r\nSmashville\r\nLylat Cruise\r\nYoshi's Story",
        "NeutralStages": "...",
        "Other": "You can find the JMU chat archive in #ganondorf-jmu",
        "PrimaryNotes": "- Pills are great in neutral, because Ganon has next to no tools to play around it\r\n- Use a lot of combo tools like D-Tilt or U-Air\r\n- Try to go for an edgeguard, since Ganon won’t die as early\r\n- Use Docs superior framedata to restrict Ganons ability to attack as much as possible, but always stay out of grab range",
        "SecondaryNotes": null,
        "TertiaryNotes": null,
        "Title": "Ganondorf",
        "Video": "[Dr. Mario vs. Ganondorf Matchup Playlist](https://www.youtube.com/playlist?list=PLaVVi_TueS9z40YinfMFmDMrgnTbI61LL)\r\n[Dr. Mario vs. Ganondorf JMU Crew Battle](https://www.twitch.tv/videos/478893720?filter=all&sort=time)",
        "WinningStages": "\r\nTown & City\r\nKalos"
  ***REMOVED***,
    ***REMOVED***
        "Character": "greninja",
        "Color": "#0049A2",
        "Document": null,
        "LosingStages": "\r\nKalos\r\nSmall Battlefield\r\nPokemon Stadium 2",
        "NeutralStages": "...",
        "Other": null,
        "PrimaryNotes": "- His aerials are unsafe on shield unless they're spaced at max range\r\n- Play the keep away game with ground attacks like Jab and F-Tilt\r\n- Avoid using pill in neutral since his mobility allows him to just run under and punish us\r\n- Full hop dropdown N-Air is good against Greninja since most of his approaches are horizontal and more ground based (like Dash Attack/Grab)\r\n- Be aware of his D-Tilt at higher percents, which leads to U-Smash\r\n- It's sometimes better to just go the ledge while landing, however, B-Reverse cape mix-ups in disadvantage work really well against him, too\r\n- Reflect Shurikens whenever you can\r\n- Be careful with Tornado edgeguarding, since he can use Side-B to surprise attack us\r\n- Make sure to DI most of his combos away\r\n- Tech U-Air dragdown\r\n",
        "SecondaryNotes": null,
        "TertiaryNotes": null,
        "Title": "Greninja",
        "Video": "[Dr. Mario vs. Greninja Matchup Playlist](https://www.youtube.com/playlist?list=PLaVVi_TueS9zdqPKdGoifoLcF0wwUOfxE)",
        "WinningStages": "\r\nFinal Destination\r\nYoshi's Story\r\nSmashville"
  ***REMOVED***,
    ***REMOVED***
        "Character": "hero",
        "Color": "#5F4A3F",
        "Document": null,
        "LosingStages": "\r\nKalos\r\nTown & City",
        "NeutralStages": "...",
        "Other": null,
        "PrimaryNotes": "- Run-up shield is the best option against Hero's Down-B since it covers any of his hitboxes (besides Kamikaze and Hatchet Man)\r\n- If you get Side-B'd, don't land predictably since most Hero's will go for another Side-B\r\n- You can reflect many of his spells like Snooze, so try to react to it whenever possible\r\n- Try fighting him up close since most of his moves come out relatively slow",
        "SecondaryNotes": null,
        "TertiaryNotes": null,
        "Title": "Hero",
        "Video": "[Dr. Mario vs. Hero Matchup Playlist](https://www.youtube.com/playlist?list=PLaVVi_TueS9xZ2IObPFEp96WKZSiLcU1a)",
        "WinningStages": "\r\nFinal Destination\r\nLylat Cruise"
  ***REMOVED***,
    ***REMOVED***
        "Character": "iceclimbers",
        "Color": "#f7f7f7",
        "Document": null,
        "LosingStages": "\r\nBattlefield\r\nSmashville",
        "NeutralStages": "...",
        "Other": "You can find the JMU chat archive in iceclimber-jmu",
        "PrimaryNotes": "- Try to seperate them with Tornado as often as you can and kill Nana afterwards\r\n- Don't directly approach them since their Blizzwall strategy covers most of our options\r\n- Try not to grab Nana when Popo is near\r\n- Play the keep away game with pills and avoid getting grabbed at any cost\r\n- Prepare to deal with lots of juggles\r\n- Respect their Smash attacks since they're very quick and strong\r\n- Icies Side-B is very hard to punish since it has low endlag, lots of priority it's a multihit move so focus on what they do afterwards",
        "SecondaryNotes": null,
        "TertiaryNotes": null,
        "Title": "Ice Climbers",
        "Video": "[Dr. Mario vs. Ice Climbers Matchup Playlist](https://www.youtube.com/playlist?list=PLaVVi_TueS9yGAw5TqZDGnSOtO3r4LXE8)",
        "WinningStages": "\r\nTown & City\r\nSmall Battlefield"
  ***REMOVED***,
    ***REMOVED***
        "Character": "ike",
        "Color": "#00479F",
        "Document": null,
        "LosingStages": "\r\nBattlefield\r\nYoshi's Story\r\nSmashville",
        "NeutralStages": "...",
        "Other": null,
        "PrimaryNotes": "- Pills are great if you stay out of punish range\r\n- Intercept Ike with air to air combat, since he wants to rely on landing N-Air a lot\r\n- Either punish Ike N-Air with Up B or punish the options he will do next\r\n- Ike Up B has armor that will also punish a lot of our best attacks, so respect his shield an dont get caught by it at ledge, because he is able to follow up after he snaps the ledge",
        "SecondaryNotes": null,
        "TertiaryNotes": null,
        "Title": "Ike",
        "Video": "[Dr. Mario vs. Ike Matchup Playlist](https://www.youtube.com/playlist?list=PLaVVi_TueS9xFWT_HMNLBuez8huWxkf-U)",
        "WinningStages": "\r\nFinal Destination\r\nSmall Battlefield\r\nPokemon Stadium 2"
  ***REMOVED***,
    ***REMOVED***
        "Character": "incineroar",
        "Color": "#D43823",
        "Document": "[Dr. Mario vs. Incineroar MU Guide](https://docs.google.com/document/d/1p-5v6sMkbWI1KhooJQ4aPZuitDayyVXOuJgv7hKBz44/edit?usp=sharing)",
        "LosingStages": "\r\nBattlefield\r\nYoshi's Story\r\nSmashville\r\nTown & City",
        "NeutralStages": "...",
        "Other": null,
        "PrimaryNotes": "- Doc can easily punish Incineroar off stage by catching a low Alolan Whip with tornado and make it back to stage if he still has his double jump\r\n- You can break out of combos using Neutral Air, Up Special, and Up Air\r\n- Mixup your landing by using B-Reversed Side Special [Cape], Tornado, or Double Jump after a ledge jump\r\n- Use pills as an approach tool at close/mid range so that he doesn't have the time to charge up by it\r\n- Crossing up the Incineroar’s shield is a good idea with B-Air or N-Air, but it can be difficult to get anything out of it due to Incineroar’s great OOS options; however, even an OOS option can be baited out and punished",
        "SecondaryNotes": null,
        "TertiaryNotes": null,
        "Title": "Incineroar",
        "Video": "[Dr. Mario vs. Incineroar Matchup Playlist](https://www.youtube.com/playlist?list=PLaVVi_TueS9x5lVy21CEyQ6eJQNliX9bv)",
        "WinningStages": "\r\nFinal Destination\r\nPokemon Stadium 2"
  ***REMOVED***,
    ***REMOVED***
        "Character": "inkling",
        "Color": "#FF8114",
        "Document": null,
        "LosingStages": "\r\nLylat Cruise\r\nSmashville",
        "NeutralStages": "...",
        "Other": null,
        "PrimaryNotes": "- Doc wants to play vertically in his matchup since Inkling's B-Air is safe on shield and it will lead to combo extensions\r\n- Doc wants to fullhop dropdown N-Air as well as using safe ground attacks like Jab and F-Tilt\r\n- You can reflect her splat bomb and splattershot (though the interaction with the latter is weird)\r\n- Inkling struggles killing if you don't get hit by splat roller, you can shield and punish it accordingly with i.e. Up-B\r\n- Use pills with caution since Inkling can move under them and punish us",
        "SecondaryNotes": null,
        "TertiaryNotes": null,
        "Title": "Inkling ",
        "Video": "[Dr. Mario vs. Inkling Matchup Playlist](https://www.youtube.com/playlist?list=PLaVVi_TueS9yM4V6N0gZMyav9PsgQ0HKR)",
        "WinningStages": "\r\nYoshi's Story\r\nBattlefield"
  ***REMOVED***,
    ***REMOVED***
        "Character": "isabelle",
        "Color": "#FFF68C",
        "Document": null,
        "LosingStages": "\r\nKalos\r\nSmashville",
        "NeutralStages": "...",
        "Other": null,
        "PrimaryNotes": "- Make sure not to jump between the pull and the hook when she uses Fishing Rod\r\n- Watch out for grounded Lloyd Rocket\r\n- Just like with any other projectile character, reflecting her stuff is good but don't build your gameplan around it\r\n- Play patient in neutral, don't rush into her traps, take your time",
        "SecondaryNotes": null,
        "TertiaryNotes": null,
        "Title": "Isabelle",
        "Video": "[Dr. Mario vs. Isabelle Matchup Playlist](https://www.youtube.com/playlist?list=PLaVVi_TueS9zaLJtb8fqfUcX0NTyRCWYL)",
        "WinningStages": "\r\nPokemon Stadium 2\r\nSmall Battlefield"
  ***REMOVED***,
    ***REMOVED***
        "Character": "jigglypuff",
        "Color": "#F9C5D0",
        "Document": null,
        "LosingStages": "\r\nTown & City\r\nSmashville",
        "NeutralStages": "...",
        "Other": null,
        "PrimaryNotes": "- Play grounded and abuse Doc's out of shield game, watch out for pound shield breaks however\r\n- You can also stuff most of her approaches with U-Smash out\r\n- Commit to stage control, you don't want to be offstage vs her\r\n- Play patient and single-hit based, don't try to extend your advantage state too much because she's very hard to combo in general\r\n- Be aware of her rest setups such as dropdown D-air into Down-B",
        "SecondaryNotes": null,
        "TertiaryNotes": null,
        "Title": "Jigglypuff",
        "Video": "[Dr. Mario vs. Jigglypuff Matchup Playlist](https://www.youtube.com/playlist?list=PLaVVi_TueS9wJCIu85IvJruV89d4Zh5QG)",
        "WinningStages": "\r\nFinal Destination\r\nBattlefield\r\n Yoshi's Story"
  ***REMOVED***,
    ***REMOVED***
        "Character": "joker",
        "Color": "#0E0E0E",
        "Document": null,
        "LosingStages": "\r\nTown & City\r\nSmashville",
        "NeutralStages": "...",
        "Other": "Credits goes to PhDream#2000 for providing these tips! Check the pinned messages in #ultimate-metagame if you want a more in-depth version.",
        "PrimaryNotes": "- Stick to Doc's usual gameplan by throwing out B-Airs, tilts and pills in neutral to disrupt Joker's movement, condition shield or jump etc.\r\n- Whenever you're doing a combo that isn't exactly true, a common Joker habit is to use Rebel's Guard or Tetrakarn/Makarakarn to break out of the combo; Be wary of this and try to call it out from time to time and get an even harder punish on Joker from that\r\n- You need to be careful of how you're throwing pills at him, since he has Rebel's Guard to tank them and fill his meter, he has attacks that are mainly disjointed to outrange and stuff Doc out\r\n- Play patient and take your time in this MU, as Doc isn't suited for rushing Joker down",
        "SecondaryNotes": null,
        "TertiaryNotes": null,
        "Title": "Joker",
        "Video": "[Dr. Mario vs. Joker Matchup Playlist](https://www.youtube.com/playlist?list=PLaVVi_TueS9zzzPD-iTOUz1lPKJFx2gnG)",
        "WinningStages": "\r\nFinal Destination"
  ***REMOVED***,
    ***REMOVED***
        "Character": "kingdedede",
        "Color": "#FFB500",
        "Document": null,
        "LosingStages": "\r\nFinal Destination\r\nKalos",
        "NeutralStages": "...",
        "Other": null,
        "PrimaryNotes": "- Pills are valueable as long as you don’t get caught by DDDs Neutral B, also they reflect Gordo well\r\n- Putting out a hitbox against Gordo isn‘t a bad idea as you will also apply counterpressure while doing so\r\n- Dash Attack the ledge to catch DDDs ledge snap consistently\r\n- Avoid DDDs neutral B at ledge as he will try to cheese you offstage",
        "SecondaryNotes": null,
        "TertiaryNotes": null,
        "Title": "King Dedede",
        "Video": "[Dr. Mario vs. King Dedede Matchup Playlist](https://www.youtube.com/playlist?list=PLaVVi_TueS9wyFVmvGAIV6oNx37u4PMjM)",
        "WinningStages": "\r\nBattlefield\r\nYoshi's Story\r\nSmall Battlefield\r\nTown & City"
  ***REMOVED***,
    ***REMOVED***
        "Character": "kingkrool",
        "Color": "#008F00",
        "Document": "[Dr. Mario vs. King K. Rool MU Guide](https://docs.google.com/document/d/1QJsLmMRKB1gG0I9eSVK9bOFZ3qpumkGFF5QyvCeb9lA/edit?usp=sharing)",
        "LosingStages": "\r\nTown & City\r\nSmashville",
        "NeutralStages": "...",
        "Other": "You can find the JMU chat archive in #kkrool-jmu",
        "PrimaryNotes": "- Rely on Doc's Pills for neutral, approach and combo options while also relining on his B-Air\r\n- Reflect his projectiles whenever you can and don't end up between them and K.Rool\r\n- Tomahawk grabs and U-Smashes are good for getting him off you without getting clipped by his armor moves\r\n- Feel free to extend your advantage state as much as possible; U-Tilt strings, U-Air juggles etc. work very well on K.Rool\r\n- Try to avoid K.Rool's N-Air zone while recovering if possible",
        "SecondaryNotes": null,
        "TertiaryNotes": null,
        "Title": "King K. Rool",
        "Video": "[Dr. Mario vs. King K. Rool Matchup Playlist](https://www.youtube.com/playlist?list=PLaVVi_TueS9y7suoAMzPC8CRUpH_YaMqf)",
        "WinningStages": "\r\nSmall Battlefield\r\nFinal Destination\r\nLylat Cruise"
  ***REMOVED***,
    ***REMOVED***
        "Character": "kirby",
        "Color": "#F2A9B2",
        "Document": null,
        "LosingStages": "\r\nFinal Destination\r\nSmashville\r\nTown & City",
        "NeutralStages": "...",
        "Other": null,
        "PrimaryNotes": "- Avoid Kirbys neutral B at ledge as he will try to cheese you offstage\r\n- Use quick anti-airs to get Kirby offstage to set up edgeguards or take stage control\r\n- Avoid grabs since they give Kirby quite a few options at low percent",
        "SecondaryNotes": null,
        "TertiaryNotes": null,
        "Title": "Kirby",
        "Video": "[Dr. Mario vs. Kirby Matchup Playlist](https://www.youtube.com/playlist?list=PLaVVi_TueS9wFGbJZTg3H7eCfc-b3DI_p)",
        "WinningStages": "\r\nBattlefield\r\nYoshi's Story\r\nSmall Battlefield"
  ***REMOVED***,
    ***REMOVED***
        "Character": "link",
        "Color": "#C1AB1B",
        "Document": null,
        "LosingStages": "\r\nTown & City\r\nSmashville\r\nKalos",
        "NeutralStages": "...",
        "Other": null,
        "PrimaryNotes": "- Pills aren’t great in this Matchup, because you will have to deal with Link’s projectiles all the time\r\n- Use Docs OoS options like U-Smash or Up B to punish Links NAir or other aerials once he gets too close\r\n- Reflect the bombs explosion with Cape to make it easier to go for the ledge if you find yourself offstage\r\n- Reflect boomerang as well for free counterpressure\r\n- Don’t mash carelessly attacks on Links shield, or else you will get hit by his Up B OoS a lot\r\n- Avoid standing too close to the ledge as Links often reverse their Up B to get an unexpected reversal",
        "SecondaryNotes": null,
        "TertiaryNotes": null,
        "Title": "Link",
        "Video": "[Dr. Mario vs. Link Matchup Playlist](https://www.youtube.com/playlist?list=PLaVVi_TueS9x21fgrfWw54UZtW0OtbmsA)",
        "WinningStages": "\r\nBattlefield\r\n Yoshi's Story\r\nLylat Cruise"
  ***REMOVED***,
    ***REMOVED***
        "Character": "littlemac",
        "Color": "#157615",
        "Document": null,
        "LosingStages": "\r\nBattlefield\r\nSmall Battlefield\r\nSmashville",
        "NeutralStages": "...",
        "Other": null,
        "PrimaryNotes": "- Pills are great to stop Mac from approaching, but he can use his counter to get around them\r\n- Use platforms to get around Macs pressure\r\n- Often one Down B into another hit is enough to take a stock from Little Mac, so opt for stage control\r\n- Don’t mash attacks as Mac will armor through with smash attacks\r\n- Macs attacks arent very safe on block, but deal a ton of shield damage",
        "SecondaryNotes": null,
        "TertiaryNotes": null,
        "Title": "Little Mac",
        "Video": "[Dr. Mario vs. Little Mac Matchup Playlist](https://www.youtube.com/playlist?list=PLaVVi_TueS9xPzr3idH9_gD7V06jEJzOQ)",
        "WinningStages": "\r\nPokemon Stadium 2\r\nLylat Cruise\r\nKalos"
  ***REMOVED***,
    ***REMOVED***
        "Character": "lucario",
        "Color": "#00A3E2",
        "Document": null,
        "LosingStages": "\r\nBattlefield\r\nYoshi's Story\r\nKalos",
        "NeutralStages": "...",
        "Other": null,
        "PrimaryNotes": "- Bait him to grab at low percents\r\n- Doc can punish most of his stuff out of shield unless Lucario is at higher percents\r\n- Try to kill him as early as possible due to aura but don't panic; Doc has more than enough kill options\r\n- You can reflect his aura sphere, so react and reflect whenever you can\r\n- Tornado near the ledge works really well since it covers most of his recovery options",
        "SecondaryNotes": null,
        "TertiaryNotes": null,
        "Title": "Lucario",
        "Video": "[Dr. Mario vs. Lucario Matchup Playlist](https://www.youtube.com/playlist?list=PLaVVi_TueS9zMwqUX8qHryFh_XDfJ2BBy)",
        "WinningStages": "\r\nFinal Destination\r\nSmashville"
  ***REMOVED***,
    ***REMOVED***
        "Character": "lucas",
        "Color": "#EECA25",
        "Document": null,
        "LosingStages": "\r\nLylat Cruise\r\nTown & City\r\nKalos",
        "NeutralStages": "...",
        "Other": null,
        "PrimaryNotes": "- Prepare for camping with PK-Fire so cape it consequently\r\n- His gameplan is otherwise relatively straightforward; going for N-Air approaches (which is mostly unsafe on Doc's shield), and spacing with midair Rope Snake\r\n- Use pills to block his horizontal approaches and thus limiting his neutral options\r\n- Try rather ledgetrapping than edgeguarding him since it's very risky to contest his Up-B",
        "SecondaryNotes": null,
        "TertiaryNotes": null,
        "Title": "Lucas",
        "Video": "[Dr. Mario vs. Lucas Matchup Playlist](https://www.youtube.com/playlist?list=PLaVVi_TueS9xYx46eYwH1MzbKhrVRQdko)",
        "WinningStages": "\r\nFinal Destination\r\nSmashville\r\nSmall Battlefield"
  ***REMOVED***,
    ***REMOVED***
        "Character": "luigi",
        "Color": "#429738",
        "Document": null,
        "LosingStages": "\r\nSmashville\r\nYoshi's Story",
        "NeutralStages": "...",
        "Other": null,
        "PrimaryNotes": "- Play around his grab obviously; you don't want to get 0 to death'd\r\n- Platform camping at low percents and purposefully letting him hit you once or twice can be a good idea to avoid his true kill combo\r\n- Mix-up how you deal with grab however; if you jump too often he'll punish it with F-Air for example\r\n- Prevent Luigi from getting in by walling him out with B-Air and pills\r\n- Prevent Luigi from getting in by walling him out with B-Air and pills",
        "SecondaryNotes": null,
        "TertiaryNotes": null,
        "Title": "Luigi",
        "Video": "[Dr. Mario vs. Luigi Matchup Playlist](https://www.youtube.com/playlist?list=PLaVVi_TueS9zWizm8McTLuRPpMZER6z1r)",
        "WinningStages": "\r\nPokemon Stadium 2\r\nSmall Battlefield"
  ***REMOVED***,
    ***REMOVED***
        "Character": "mario",
        "Color": "#E72B2D",
        "Document": "[Dr. Mario vs. Mario MU Guide](https://docs.google.com/document/d/17nQjJizoEO8JChADFM9Mzf8yD_skHUeLdN3O6_4gIAw/edit?usp=sharing)",
        "LosingStages": "\r\nBattlefield\r\nYoshi's Story\r\nTown & City",
        "NeutralStages": "...",
        "Other": null,
        "PrimaryNotes": "- Doc's win conditions involves out-trading and killing Mario via his stronger, more damaging aerials and kill confirms\r\n- Spacing is very good important in this MU as Mario will optimally try to whiff punish your attacks\r\n- Don't recover high against Mario, mainly because of F.L.U.D.D. and B-Air\r\n- Be careful when landing and don't overuse N-Air for combo breaking because Mario can get an easy punish out if it the player anticipates it",
        "SecondaryNotes": null,
        "TertiaryNotes": null,
        "Title": "Mario",
        "Video": "[Dr. Mario vs. Mario Matchup Playlist](https://www.youtube.com/playlist?list=PLaVVi_TueS9xwW4Tod0JUlt1z3Kw69-bj)",
        "WinningStages": "\r\nFinal Destination\r\nSmashville"
  ***REMOVED***,
    ***REMOVED***
        "Character": "marth",
        "Color": "#2C4A8B",
        "Document": null,
        "LosingStages": "\r\nBattlefield\r\nSmashville\r\nYoshi's Story\r\nKalos",
        "NeutralStages": "...",
        "Other": null,
        "PrimaryNotes": "- Pills should be used sparingly because their sword can slice through them\r\n- Intercept their aerials or their attacks in between, because Doc can’t challenge their sword attacks\r\n- Stay aware of their Side B, since they are able to pressure and close in at the same time\r\n- Try to take as much stage control as possible, because they need space to execute pressure as safe as possible\r\n- Avoid platforms as their U-Tilt and U-Air are great to catch your landings",
        "SecondaryNotes": null,
        "TertiaryNotes": null,
        "Title": "Marth",
        "Video": "[Dr. Mario vs. Marth (Lucina) Matchup Playlist](https://www.youtube.com/playlist?list=PLaVVi_TueS9xcKHwh80BNKDtJ1kV-npQc)",
        "WinningStages": "\r\nFinal Destination\r\nPokemon Stadium 2"
  ***REMOVED***,
    ***REMOVED***
        "Character": "megaman",
        "Color": "#0372EA",
        "Document": null,
        "LosingStages": "\r\nKalos\r\nTown & City",
        "NeutralStages": "...",
        "Other": null,
        "PrimaryNotes": "- Every projectile Mega Man has is reactable with cape\r\n- Try to stay up close since most of his close range moves are punishable, especially on shield\r\n- MM is very vulnerable offstage, if he's forced to recover low, that's a free Tornado edgeguard most of the time\r\n- It's hard for him to punish RAR B-Air since he doesn't really have good O.O.S. options\r\n- Watch out for his B-Air, it comes out on frame 4 and it's very strong\r\n- Avoid being too close to him when he is holding metal blade",
        "SecondaryNotes": null,
        "TertiaryNotes": null,
        "Title": "Mega Man",
        "Video": "[Dr. Mario vs. Mega Man Matchup Playlist](https://www.youtube.com/playlist?list=PLaVVi_TueS9yMMSInQTq3GV7y_xtg4BiG)",
        "WinningStages": "\r\nPokemon Stadium 2\r\nFinal Destination"
  ***REMOVED***,
    ***REMOVED***
        "Character": "metaknight",
        "Color": "#C9CACA",
        "Document": null,
        "LosingStages": "\r\nKalos\r\nTown & City\r\nBattlefield",
        "NeutralStages": "...",
        "Other": "You can find the JMU chat archive in #metaknight-jmu",
        "PrimaryNotes": "- Try to move slowly to corner him\r\n- A good MK won't commit in this matchup; stage control is key so don't try to overextend\r\n- Don't go offstage since he has a really good recovery that can't really be edgeguarded with Doc; opt for ledgetrapping instead\r\n- MK's offstage pressure is tough to deal with. Doc should try to recover low, tornadoing first, trying to move around Meta Knight's attacks\r\n- His neutral is relatively linear and full of 50/50's so if you can get a read and what they like to do it makes things easier\r\n- Universally the way to nullify most of this pressure without guessing comes down to baiting either with stronger short hop aerials, or retreat shield\r\n\t- Both of these options are quite applicable to Doc used carefully when he can beat Dash Attack's directly with B-air or N-air, or Up-B OoS\r\n- Mix up your DI on throws to avoid getting juggled by him",
        "SecondaryNotes": null,
        "TertiaryNotes": null,
        "Title": "Meta Knight",
        "Video": "[Dr. Mario vs. Meta Knight Matchup Playlist](https://www.youtube.com/playlist?list=PLaVVi_TueS9xY46sJ7jbcnCW4o3w-E2VP)",
        "WinningStages": "\r\nPokemon Stadium 2\r\nFinal Destination\r\nSmall Battlefield"
  ***REMOVED***,
    ***REMOVED***
        "Character": "mewtwo",
        "Color": "#E6D4E7",
        "Document": null,
        "LosingStages": "\r\nKalos\r\nTown & City",
        "NeutralStages": "...",
        "Other": "Credits goes to PhDream#2000 for providing these tips! Check the pinned messages in #ultimate-metagame if you want a more in-depth version.",
        "PrimaryNotes": "- Stay relatively grounded, don't be in the air all too much because he can very well just stuff you out with Nair, U-Tilt, Dash Back F-Tilt etc.\r\n- It mainly comes down to good patience, recognizing key openings whenever Mewtwo throws out an attack, knowing when to reflect Shadow Ball and when not to, and so on\r\n- Be smart with how you're using Tornado and your Double Jump offstage; try mixing up between recovering high and recovering low to give the Mewtwo less of a chance to adapt to how you're making it back",
        "SecondaryNotes": null,
        "TertiaryNotes": null,
        "Title": "Mewtwo",
        "Video": "[Dr. Mario vs. Mewtwo Matchup Playlist](https://www.youtube.com/playlist?list=PLaVVi_TueS9xfotn-9mI5CmRl8maB3wqP)",
        "WinningStages": "\r\nSmashville\r\nLylat Cruise"
  ***REMOVED***,
    ***REMOVED***
        "Character": "miibrawler",
        "Color": "#fb3530",
        "Document": null,
        "LosingStages": "\r\nBattlefield\r\nYoshi's Story",
        "NeutralStages": "...",
        "Other": null,
        "PrimaryNotes": "- Play neutral by using defensive movement to force unsafe moves on Doc's shield which you can punish\r\n- When having stage control, it's best to use pills for zoning and not committing too much in general; Mii Brawler's options in disadvantage, especially from the ledge, are decent and don't even try edgeguarding Brawler in the first place unless you have a big read\r\n- Doc should stay away as far as possible from Brawler in disadvantage, if that means getting ledgetrapped do it. It's better than dying to a platform combo at ~60%\r\n-Speaking of which, avoid staying on platforms at all cost. If you end up in a platform combo situation, DI'ing away is the most optimal choice \r\n- If you don't have movement options available like jump, use N-Air. Even though it can be whiff punished, it trades with Up-B, which is far better than anything",
        "SecondaryNotes": null,
        "TertiaryNotes": null,
        "Title": "Mii Brawler",
        "Video": "[Dr. Mario vs. Mii Fighter Matchup Playlist](https://youtube.com/playlist?list=PLaVVi_TueS9yr8f0mbJttnbkokAv8yqQO)",
        "WinningStages": "\r\nFinal Destination\r\nTown & City"
  ***REMOVED***,
    ***REMOVED***
        "Character": "miigunner",
        "Color": "#0463d1",
        "Document": null,
        "LosingStages": null,
        "NeutralStages": "...",
        "Other": null,
        "PrimaryNotes": null,
        "SecondaryNotes": null,
        "TertiaryNotes": null,
        "Title": "Mii Gunner",
        "Video": "[Dr. Mario vs. Mii Fighter Matchup Playlist](https://youtube.com/playlist?list=PLaVVi_TueS9yr8f0mbJttnbkokAv8yqQO)",
        "WinningStages": null
  ***REMOVED***,
    ***REMOVED***
        "Character": "miiswordfighter",
        "Color": "#dddddc",
        "Document": null,
        "LosingStages": null,
        "NeutralStages": "...",
        "Other": null,
        "PrimaryNotes": null,
        "SecondaryNotes": null,
        "TertiaryNotes": null,
        "Title": "Mii Swordfighter",
        "Video": "[Dr. Mario vs. Mii Fighter Matchup Playlist](https://youtube.com/playlist?list=PLaVVi_TueS9yr8f0mbJttnbkokAv8yqQO)",
        "WinningStages": null
  ***REMOVED***,
    ***REMOVED***
        "Character": "minmin",
        "Color": "#F2421A",
        "Document": null,
        "LosingStages": "\r\nFinal Destination\r\nSmall Battlefield\r\nKalos",
        "NeutralStages": "...",
        "Other": null,
        "PrimaryNotes": "- Don’t use pills in neutral, since Min Min wants to attack from a far as much as possible\r\n- Roll ins are a great way to get past her second arm attack, as she won’t be able to attack for short period of time\r\n- Min Min will use N-Air and U-Smash as her get-off-me options\r\n- Try to mix up your timing on Up B to make it difficult to ledgetrap for Min Min\r\n- Movement is more important in this MU than attacks, so be mindful of when to go in",
        "SecondaryNotes": null,
        "TertiaryNotes": null,
        "Title": "Min Min",
        "Video": "[Dr. Mario vs. Min Min Matchup Playlist](https://www.youtube.com/playlist?list=PLaVVi_TueS9wbRmx0hgopu8NNUnwQav0H)",
        "WinningStages": "\r\nBattlefield\r\nYoshi's Story\r\nLylat Cruise"
  ***REMOVED***,
    ***REMOVED***
        "Character": "mrgameandwatch",
        "Color": "#000000",
        "Document": null,
        "LosingStages": "\r\nLylat Cruise\r\nYoshi's Story\r\nBattlefield",
        "NeutralStages": "...",
        "Other": "You can find the JMU chat archive in #gnw-jmu",
        "PrimaryNotes": "- G&W's wants you to approach since he himself has limited approach options so don't get baited\r\n- Prevent N-Air at low percents by beating it out with U-Smash and B-Air\r\n- Opt for single-hit moves and do not extend your advantage state on him\r\n- Game & Watch's Up-B is perhaps the best out of shield move in the game; do not throw unsafe stuff on his shield\r\n- Reflect bacon when you can, especially near the ledge\r\n- Don't even try edgeguarding him; instead, stay at roll distance when ledgetrapping him, this limits his options the most\r\n- Keeping stage control, playing and not getting into disadvantage state in the first place is how you deal with G&W overall",
        "SecondaryNotes": null,
        "TertiaryNotes": null,
        "Title": "Mr. Game & Watch",
        "Video": "[Dr. Mario vs. Mr. Game & Watch Matchup Playlist](https://www.youtube.com/playlist?list=PLaVVi_TueS9yH_DQEjqHgHeYbSRpHyeKn)",
        "WinningStages": "\r\nPokemon Stadium 2\r\nFinal Destination"
  ***REMOVED***,
    ***REMOVED***
        "Character": "mythra",
        "Color": "#ebba59",
        "Document": null,
        "LosingStages": null,
        "NeutralStages": "...",
        "Other": null,
        "PrimaryNotes": null,
        "SecondaryNotes": null,
        "TertiaryNotes": null,
        "Title": "Mythra",
        "Video": "[Dr. Mario vs. Mythra/Pyra Playlist](https://www.youtube.com/playlist?list=PLaVVi_TueS9x7opbfI4Zu6mpolX2FJGnJ)",
        "WinningStages": null
  ***REMOVED***,
    ***REMOVED***
        "Character": "ness",
        "Color": "#FF2621",
        "Document": null,
        "LosingStages": "\r\nKalos\r\nYoshi's Story\r\nBattlefield",
        "NeutralStages": "...",
        "Other": null,
        "PrimaryNotes": "- Pills are great in neutral as they disrupt Ness‘ movement quite well and allow for quick counterpressure\r\n- Don’t jump in against Ness, he will go air to air with his F-Air, leading into a quick edgeguard opportunity or free damage\r\n- Stay cautious at ledge, Ness will try to cheese with his D-Smash or U-Smash, use PK fire, look for a B-Throw or throw out an aerial\r\n- Ness has great get-off-me options and combo tools, so don’t overextend your advantage\r\n- Cape allows you to avoid his projectile game if you need to snap the ledge",
        "SecondaryNotes": null,
        "TertiaryNotes": null,
        "Title": "Ness",
        "Video": "[Dr. Mario vs. Ness Matchup Playlist](https://www.youtube.com/playlist?list=PLaVVi_TueS9xW-I7niXiVMjVuu8HDcTVK)",
        "WinningStages": "\r\nLylat Cruise\r\nFinal Destination"
  ***REMOVED***,
    ***REMOVED***
        "Character": "olimar",
        "Color": "#FFE4C5",
        "Document": null,
        "LosingStages": "\r\nSmashville\r\nBattlefield",
        "NeutralStages": "...",
        "Other": null,
        "PrimaryNotes": "- Watch out for U-Smash out of shield since it can lead to many combos\r\n- Don't get grabbed at high percents when he has a blue Pikmin in line up\r\n- Edgeguard his vulnerable recovery with Tornado\r\n- Reflect his Pikmins when possible; when they are stuck to you, the best way to get rid of them is by using Cape too",
        "SecondaryNotes": null,
        "TertiaryNotes": null,
        "Title": "Olimar",
        "Video": "[Dr. Mario vs. Olimar Matchup Playlist](https://www.youtube.com/playlist?list=PLaVVi_TueS9xMZ9qbDYSdB6wUemVag5uB)",
        "WinningStages": "\r\nSmall Battlefield\r\nFinal Destination"
  ***REMOVED***,
    ***REMOVED***
        "Character": "pacman",
        "Color": "#FFFF00",
        "Document": null,
        "LosingStages": "\r\nKalos\r\nTown & City\r\nPokemon Stadium 2",
        "NeutralStages": "...",
        "Other": null,
        "PrimaryNotes": "- Do everything you can to get a lead to prevent getting camped, which Doc has a very hard time dealing with\r\n- Play patient and deal with his wall of projectiles by mixing it up with shielding, reflecting etc.\r\n- You can punish his F-Air -> N-Air approaches with Up-B out of shield\r\n- Always expect the hydrant when he's in the air and you're below him; you can reflect or bait it out\r\n- Don't contest his Side-B in general and specifically offstage",
        "SecondaryNotes": null,
        "TertiaryNotes": null,
        "Title": "Pac-Man",
        "Video": "[Dr. Mario vs. Pac-Man Matchup Playlist](https://www.youtube.com/playlist?list=PLaVVi_TueS9wBGTjUFuDK34wwGha6bNbC)",
        "WinningStages": "\r\nBattlefield\r\nYoshi's Story\r\nLylat Cruise"
  ***REMOVED***,
    ***REMOVED***
        "Character": "palutena",
        "Color": "#3EC400",
        "Document": null,
        "LosingStages": "\r\nBattlefield\r\nYoshi's Story\r\nSmall Battlefield",
        "NeutralStages": "...",
        "Other": null,
        "PrimaryNotes": "- Try to play rather agressive; using pills will be punished by Explosvie Flames and it can even be reflected\r\n- Stay close and avoid grab at the same time; you don't want to be in midrange but you also don't want to be at grab range either\r\n- Try stuffing her moves out with RAR U-Smash or by simply shielding. Wait on what she does afterwards since her F-Air/B-Air are safe on shield\r\n- Palutena's will often try to go for N-Air at low percents to start a loop; you can prevent that by shielding and possibly punishing it if misspaced\r\n- Stay grounded and try to bait a Dash Attack on shield since that is unsafe; her ground game is one of her 'weakest' sides\r\n- Stay either at roll distance or try edgeguarding her directly (the latter is more risky but also has reward and the former prevents her from just teleporting back to center stage)\r\n- You can reflect Explosive Flame, this is especially useful when getting hit offstage",
        "SecondaryNotes": null,
        "TertiaryNotes": null,
        "Title": "Palutena",
        "Video": "[Dr. Mario vs. Palutena Matchup Playlist](https://www.youtube.com/playlist?list=PLaVVi_TueS9yJpZm-SIBasJx_2BDKTrMn)",
        "WinningStages": "\r\nFinal Destination\r\nSmashville"
  ***REMOVED***,
    ***REMOVED***
        "Character": "peach",
        "Color": "#FFF2E9",
        "Document": null,
        "LosingStages": "\r\nBattlefield\r\nSmashville",
        "NeutralStages": "...",
        "Other": null,
        "PrimaryNotes": "- Don't try to grab when she goes for B-Air on shield; go for Up-B instead at higher percents\r\n- Don't challenge Side-B on shield\r\n- Try to recover low so you don't get hit by F-Air offstage, be also aware of turnips\r\n- One of her main weaknesses is landing, try to anti-air her with an U-Smash\r\n- Play neutral by going for dropdown fullhop N-Air which covers her horizontal moves\r\n- Turnip is can be caped, but don't go for it too often",
        "SecondaryNotes": null,
        "TertiaryNotes": null,
        "Title": "Peach",
        "Video": "[Dr. Mario vs. Peach (Daisy) Matchup Playlist](https://www.youtube.com/playlist?list=PLaVVi_TueS9zrsY4FMe7iHZ40p-aMFoy4)",
        "WinningStages": "\r\nPokemon Stadium 2\r\nLylat Cruise"
  ***REMOVED***,
    ***REMOVED***
        "Character": "pichu",
        "Color": "#FFF362",
        "Document": null,
        "LosingStages": "\r\nBattlefield\r\nYoshi's Story\r\nSmashville",
        "NeutralStages": "...",
        "Other": null,
        "PrimaryNotes": "- Abuse Doc's out of shield options and reflect T-Jolt; most of Pichu's win conditions are up close\r\n- Controlling the stage and not risking too much is generally the best way to play this matchup\r\n- Pichu is very explosive in advantage state and is great at edgeguarding so go back to ground as fast as you can\r\n- Besides shielding, go for tilts and fullhop dropdown N-Air in neutral to hit Pichu's small hurtbox, but prepare of getting whiff punished\r\n- Pichu's like to go for tech setups so always try to tech",
        "SecondaryNotes": null,
        "TertiaryNotes": null,
        "Title": "Pichu",
        "Video": "[Dr. Mario vs. Pichu Matchup Playlist](https://www.youtube.com/playlist?list=PLaVVi_TueS9x2VrRcrWDpZ9VCUqMYuMEH)",
        "WinningStages": "\r\nPokemon Stadium 2\r\nFinal Destination"
  ***REMOVED***,
    ***REMOVED***
        "Character": "pikachu",
        "Color": "#F3D823",
        "Document": null,
        "LosingStages": "\r\nKalos\r\nTown & City\r\nSmashville",
        "NeutralStages": "...",
        "Other": null,
        "PrimaryNotes": "- Similar to Pichu, make use of Doc's out of shield options and reflect T-Jolt so he has a hard time approaching\r\n- Besides shielding, go for tilts and fullhop dropdown N-Air in neutral to hit Pikachu's small hurtbox and stuff out Quick Attack, but prepare of getting whiff punished\r\n- You can U-Smash out of shield when Pikachu tries to go for B-Air up close\r\n- There are moments where you have enough time to combo break Pikachu's stuff with Up-B\r\n- At kill percent, be ready to DI U-Throw either left or right (mix it up between the two)",
        "SecondaryNotes": null,
        "TertiaryNotes": null,
        "Title": "Pikachu",
        "Video": "[Dr. Mario vs. Pikachu Matchup Playlist](https://www.youtube.com/playlist?list=PLaVVi_TueS9yIJG5ASCroKl1TpmxjU7b9)",
        "WinningStages": "\r\nPokemon Stadium 2\r\nBattlefield"
  ***REMOVED***,
    ***REMOVED***
        "Character": "piranhaplant",
        "Color": "#FF0000",
        "Document": null,
        "LosingStages": "\r\nSmall Battlefield\r\nPokemon Stadium 2\r\nLylat Cruise",
        "NeutralStages": "...",
        "Other": null,
        "PrimaryNotes": "- Neutral B will often break combos, so try to space your attacks and only go for grabs when Ptooie isn’t out\r\n- Side B can be reflected, which results in huge amounts of damage if your opponent isn’t aware of it\r\n- Piranha mostly kills vertically with U-Throw or U-Smash, but can kill of off a read with F-Smash as well\r\n- Plant’s dash attack is a burst option that allows your opponent to setup their ledgetraps",
        "SecondaryNotes": null,
        "TertiaryNotes": null,
        "Title": "Piranha Plant",
        "Video": "[Dr. Mario vs. Piranha Plant Matchup Playlist](https://www.youtube.com/playlist?list=PLaVVi_TueS9zDeILF2W4eR9MO8-k9WTWu)",
        "WinningStages": "\r\nFinal Destination\r\nSmashville"
  ***REMOVED***,
    ***REMOVED***
        "Character": "pokemontrainer",
        "Color": "#EFEFEF",
        "Document": null,
        "LosingStages": "\r\nBattlefield\r\nYoshi's Story\r\nTown & City",
        "NeutralStages": "...",
        "Other": null,
        "PrimaryNotes": "- Doc's tilts and fullhop dropdown N-Air are very good to hit Squirtle's small hurtbox\r\n- Be precise with your moves and and keep him at a certain distance so he can't grab\r\n- If you get hit by F-Tilt, try to mix it up with spotdodge since it doesn't always true combo into grab\r\n- DI away from his combos\r\n- Squirtle likes to go for tech setups at higher percents so always be prepared to tech\r\n- Try to recover low because of water gun",
        "SecondaryNotes": "- Ivysaur's neutral is relatively linear; stay close and reflect Raizor Leaf or move around it\r\n- Pick your openings carefuly as you slowly pressure them to do something unsafe\r\n- Approaching with B-Reverse pill is a viable option especially when the Ivysaur player likes to go for Side-B\r\n- Getting U-Air juggled can turn around a match in seconds so prevent getting into that situation in the first place by avoiding grab\r\n- N-Air and B-Air are his main out of shield options which both can be punished by U-Smash or Up-B out of shield",
        "TertiaryNotes": "- Watch out for his U-Smash out of shield, it's the fastest in the game\r\n- Play neutral by waiting and spacing B-Air safely\r\n- Stay out of tipper B-Air and F-Tilt range\r\n- DI his B-Throw out at low percents- Don't underestimate his ledgetrapping ability, as he has a N-Air that covers lots of space and 3 kill throws",
        "Title": "Pokémon Trainer",
        "Video": "[Dr. Mario vs. Pokémon Trainer Matchup Playlist](https://www.youtube.com/playlist?list=PLaVVi_TueS9yLXk8a9iJPp8U65ztzeWR-)",
        "WinningStages": "\r\nFinal Destination"
  ***REMOVED***,
    ***REMOVED***
        "Character": "pyra",
        "Color": "#ebba59",
        "Document": null,
        "LosingStages": null,
        "NeutralStages": "...",
        "Other": null,
        "PrimaryNotes": null,
        "SecondaryNotes": null,
        "TertiaryNotes": null,
        "Title": "Pyra",
        "Video": "[Dr. Mario vs. Mythra/Pyra Playlist](https://www.youtube.com/playlist?list=PLaVVi_TueS9x7opbfI4Zu6mpolX2FJGnJ)",
        "WinningStages": null
  ***REMOVED***,
    ***REMOVED***
        "Character": "rob",
        "Color": "#F4EFDD",
        "Document": null,
        "LosingStages": "\r\nKalos\r\nTown & City\r\nSmashville",
        "NeutralStages": "...",
        "Other": null,
        "PrimaryNotes": "- Pills are great if R.O.B. has used up his projectile ressources\r\n- Interrupt him with your quick aerials before his hitbox of N-Air becomes active\r\n- Gyro is a key tool in R.O.B.s gameplan, so either keep it for a while, throw it upwards or setup your own combos with it\r\n- Always be ready to reflect laser offstage or to catch Gyro\r\n- Susceptible to combos, but has big hitboxes to contest in return\r\n- Rely on your on OoS options if R.O.B pressures you too much\r\n- Ledge Gyro leads into nasty setups, so always be ready to tech if R.O.B. sets up one at ledge",
        "SecondaryNotes": null,
        "TertiaryNotes": null,
        "Title": "R.O.B",
        "Video": "[Dr. Mario vs. R.O.B. Matchup Playlist](https://www.youtube.com/playlist?list=PLaVVi_TueS9xebkr4OUquWjjnQmO5RrgW)",
        "WinningStages": "\r\nFinal Destination\r\nBattlefield\r\nYoshi's Story"
  ***REMOVED***,
    ***REMOVED***
        "Character": "ridley",
        "Color": "#636DA8",
        "Document": "[Dr. Mario vs. Ridley MU Guide](https://docs.google.com/document/d/1ohuN9NhXVPu4uKD3upXdVXIlyeMiyO4zH7NsBHDicLs/edit?usp=sharing)",
        "LosingStages": "\r\nBattlefield\r\nYoshi's Story\r\nKalos",
        "NeutralStages": "...",
        "Other": "You can find the JMU chat archive in #ridley-jmu",
        "PrimaryNotes": "- In neutral, focus on pill zoning to force approaches and adapt to how the opponents react, which will create openings \r\n- Abuse your frame data for combo extensions and focus on preventing Ridley to reset neutral in advantage state\r\n- In disadvantage, make use of Doc's out of shield options and save resources as long as possible to prevent early gimps\r\n- If you have the space, drop pills and make use of Doc's B-Reverses when landing",
        "SecondaryNotes": null,
        "TertiaryNotes": null,
        "Title": "Ridley",
        "Video": "[Dr. Mario vs. Ridley Matchup Playlist](https://www.youtube.com/playlist?list=PLaVVi_TueS9wz6PJ88RfwJEGYzNnQ6U3i)",
        "WinningStages": "\r\nFinal Destination\r\nTown & City"
  ***REMOVED***,
    ***REMOVED***
        "Character": "robin",
        "Color": "#CCCCD6",
        "Document": null,
        "LosingStages": "\r\nKalos\r\nSmashville",
        "NeutralStages": "...",
        "Other": null,
        "PrimaryNotes": "- Pills are great, but cape might net more reward since Robin relies on projectile pressure a lot\r\n- Robin has great air-to-air tools, so avoid jumping too close to him\r\n- Movement is more important than shielding, because Robin can deal a ton of shield damage over time",
        "SecondaryNotes": null,
        "TertiaryNotes": null,
        "Title": "Robin",
        "Video": "[Dr. Mario vs. Robin Matchup Playlist](https://www.youtube.com/playlist?list=PLaVVi_TueS9xCRA8xJnyRT0LQpQ2-YwkV)",
        "WinningStages": "\r\nLylat Cruise\r\nBattlefield\r\nYoshi's Story"
  ***REMOVED***,
    ***REMOVED***
        "Character": "rosalinaluma",
        "Color": "#3CC9FC",
        "Document": null,
        "LosingStages": "\r\nKalos\r\nTown & City\r\nBattlefield",
        "NeutralStages": "...",
        "Other": null,
        "PrimaryNotes": "- Try to kill/seperate Luma as quickly as possible with Tornado, but don't make it too predictable\r\n- Look out for Luma attacking you after Rosa is sent into hitstun; make sure to shield\r\n- You have to be very patient when trying to get through her wall; once Luma is gone, go in on her\r\n- She's easy to edgeguard with Tornado",
        "SecondaryNotes": null,
        "TertiaryNotes": null,
        "Title": "Rosalina",
        "Video": "[Dr. Mario vs. Rosalina & Luma Matchup Playlist](https://www.youtube.com/playlist?list=PLaVVi_TueS9zQD1a14qsFwDJbin7Oau2S)",
        "WinningStages": "\r\nFinal Destination\r\nSmashville"
  ***REMOVED***,
    ***REMOVED***
        "Character": "roy",
        "Color": "#3CC9FC",
        "Document": null,
        "LosingStages": "\r\nTown & City\r\nSmashville\r\nYoshi's Story",
        "NeutralStages": "...",
        "Other": "Credits goes to PhDream#2000 for providing these tips! Check the pinned messages in #ultimate-metagame if you want a more in-depth version.",
        "PrimaryNotes": "- Don't be overwhelmed by their pressure; don't punish what they hit my shield with, punish what they swing with next\r\n- Stay outside of their sword range in neutral, whiff punish any aerial attempts (N-Air and F-Air) and control their ground space with Pills (which they can swing through so be mindful of that)\r\n- As Chrom recovers upwards, he doesn't throw his sword like Ike does, so that leaves opponents free to throw out a hitbox and knock him outwards with no option. Doc's best options are: Late N-Air, F-Smash, D-Smash, B-Air, F-Tilt and D-Air",
        "SecondaryNotes": null,
        "TertiaryNotes": null,
        "Title": "Roy",
        "Video": "[Dr. Mario vs. Roy (Chrom) Matchup Playlist](https://www.youtube.com/playlist?list=PLaVVi_TueS9yyaRNEso7CY8olGSk-235t)",
        "WinningStages": "\r\nFinal Destination\r\nPokemon Stadium 2"
  ***REMOVED***,
    ***REMOVED***
        "Character": "ryu",
        "Color": "#1B040F",
        "Document": null,
        "LosingStages": "\r\nLylat Cruise\r\nSmashville\r\nSmall Battlefield",
        "NeutralStages": "...",
        "Other": null,
        "PrimaryNotes": "- Pills are great since they keep Ryu busy and clank with Hadouken\r\n- Always opt to DI out, since Ryu kills vertically\r\n- Cape is great for counterpressure or even setting up combos\r\n- Rely on your OoS options and don’t jump in against Ryu\r\n- Avoid overshielding up close as Ryu might break your shield with heavy F-Tilt",
        "SecondaryNotes": "- Don’t let Ken in for free, anti-air his N-Air approach or punish with Up B\r\n- Use your shield sparingly, as Ken will break your shield up close even if slightly damage\r\n- Docs N-Air and Up B will often lead into a combo break, but try to find other ways out of disadvantage so you don’t get punished for repetitive interactions\r\n- Rely on your quick OoS options as Ken doesnt have the most reliable shield pressure against our kit\r\n- Down B will break Kens own Down B armor, also it will grant you free stage control or net you a stock",
        "TertiaryNotes": null,
        "Title": "Ryu",
        "Video": "[Dr. Mario vs. Ryu (Ken) Matchup Playlist](https://www.youtube.com/playlist?list=PLaVVi_TueS9ykm6QK_L3_-2vz0jF7QpB0)",
        "WinningStages": "\r\nFinal Destination\r\nBattlefield"
  ***REMOVED***,
    ***REMOVED***
        "Character": "sephiroth",
        "Color": "#C0C0C0",
        "Document": null,
        "LosingStages": "\r\nKalos\r\nYoshi's Story",
        "NeutralStages": "...",
        "Other": null,
        "PrimaryNotes": "- Use crouch at a certain distance to duck under Sephiroth's single hit, long-range moves to get an opening\r\n- Be aware that Sephiroth players will adapt to ducking under their attacks and will try to go for something like dash attack and dash grab instead. This creates 50/50's that you constantly need to be aware of\r\n- Pills from high up are great at mid- and long-range but Sephiroth has the ability to call your jumps out quite easily so recognize when he's adapting to it\r\n- Try to react to Shadow Flare and reflect whenever possible\r\n-In disadvantage, timing your airdodge just right is the most important thing to escape a juggle situation, as Sephiroth relies on single-hit moves",
        "SecondaryNotes": null,
        "TertiaryNotes": null,
        "Title": "Sephiroth",
        "Video": "[Dr. Mario vs. Sephiroth Matchup Playlist](https://www.youtube.com/playlist?list=PLaVVi_TueS9wIxdnzfPyKt7q6bppeV_6F)",
        "WinningStages": "\r\nFinal Destination\r\nSmall Battlefield"
  ***REMOVED***,
    ***REMOVED***
        "Character": "sheik",
        "Color": "#C8C9CA",
        "Document": null,
        "LosingStages": "\r\nKalos\r\nTown & City\r\nBattlefield",
        "NeutralStages": "...",
        "Other": null,
        "PrimaryNotes": "- Doc's goal is to trade with her on neutral interactions with moves such as B-Air or N-Air\r\n- Most of her stuff is not punishable on shield if well spaced, so look out for what she's trying to do after\r\n- Don't N-Air out of F-Tilt combos too often at low percentsm- Shiek has trouble killing while Doc doesn't, so holding center stage is the way to go in this matchup",
        "SecondaryNotes": null,
        "TertiaryNotes": null,
        "Title": "Sheik",
        "Video": "[Dr. Mario vs. Sheik Matchup Playlist](https://www.youtube.com/playlist?list=PLaVVi_TueS9waGVCKHZDDpjaJvV4R3-E6)",
        "WinningStages": "\r\nFinal Destination\r\nSmashville"
  ***REMOVED***,
    ***REMOVED***
        "Character": "shulk",
        "Color": "#F3E6D4",
        "Document": null,
        "LosingStages": "\r\nBattlefield\r\nSmashville",
        "NeutralStages": "...",
        "Other": null,
        "PrimaryNotes": "- Pills are difficult to use when Shulk can just slice through them with N-Air or F-Air, so use them carefully\r\n- Shulks best approach is to use N-Air and F-Air while speed monado is active, so take a lot of evasive actions until you are ready to play a comfortable neutral again\r\n- Always hold center stage, as a single offstage interaction often leads into an edgeguard\r\n- Try to opt for stage control instead of combo damage, as Shulk is most vulnerable offstage and limits ist option heavily",
        "SecondaryNotes": null,
        "TertiaryNotes": null,
        "Title": "Shulk",
        "Video": "[Dr. Mario vs. Shulk Matchup Playlist](https://www.youtube.com/playlist?list=PLaVVi_TueS9y6YIipC3ATtZAKjPiarx6Q)",
        "WinningStages": "\r\nFinal Destination\r\nTown & City"
  ***REMOVED***,
    ***REMOVED***
        "Character": "simon",
        "Color": "#D4B700",
        "Document": null,
        "LosingStages": "\r\nBattlefield\r\nYoshi's Story\r\nLylat Cruise",
        "NeutralStages": "...",
        "Other": "You can find the JMU chat archive in #belmont-jmu",
        "PrimaryNotes": "- Pills are great as long as you don’t get caught by their projectiles\r\n- Take as much space as possible to make it difficult to execute their gameplan\r\n- Reflect Holy Cross or the axe for free counterpressure\r\n- Don’t give the vampire hunters any time to set up their ledgetraps; if they do have time, delay your recovery for a bit to mess up their timing\r\n- Respect their Up B as it kills of off D-Air and is a good OoS option",
        "SecondaryNotes": null,
        "TertiaryNotes": null,
        "Title": "Simon",
        "Video": "[Dr. Mario vs. Simon Belmont (Richter) Matchup Playlist](https://www.youtube.com/playlist?list=PLaVVi_TueS9whYMVbzdf-XSXC2orpLnwt)\r\n[Dr. Mario vs. Simon Belmont (Richter) JMU Crew Battle](https://www.twitch.tv/videos/733486390)",
        "WinningStages": "\r\nFinal Destination\r\nSmashville"
  ***REMOVED***,
    ***REMOVED***
        "Character": "snake",
        "Color": "#898989",
        "Document": null,
        "LosingStages": "\r\nLylat Cruise\r\nBattlefield",
        "NeutralStages": "...",
        "Other": null,
        "PrimaryNotes": "- Doc's main goal is to mess up Snake's gameplan by using pills and reflecting his projectiles\r\n- Snake's main approach option is dash attack and easy to punish when anticipated\r\n- Make sure you keep track of where his C4 is at all times\r\n- Don't hit his shield on platforms if he has a grenade\r\n- Offstage, hit Nikita to make it worse, and/or be less predictable with how you recover\r\n- You can edgeguard him with D-Air or Tornado if he goes around the ledge\r\n- Force low angles against Snake to catch Snake offstage and break his Cipher armor\r\n- Don’t force jump ins as Snake can catch you with N-Air or U-Tilt\r\n Respect D-Air OoS as it will punish a lot of options up close",
        "SecondaryNotes": null,
        "TertiaryNotes": null,
        "Title": "Snake",
        "Video": "[Dr. Mario vs. Snake Matchup Playlist](https://www.youtube.com/playlist?list=PLaVVi_TueS9x6m2C5qzi0ijS3v8FJV-3y)",
        "WinningStages": "\r\nFinal Destination\r\nSmashville"
  ***REMOVED***,
    ***REMOVED***
        "Character": "sonic",
        "Color": "#0526D2",
        "Document": null,
        "LosingStages": "\r\nTown & City\r\nKalos\r\nPokemon Stadium 2",
        "NeutralStages": "...",
        "Other": null,
        "PrimaryNotes": "- Pills have their best utility in long range, since Sonic wants to disengage as much as possible\r\n- Don’t force a punish against Sonic, because it will often whiff due to Sonic’s speed\r\n- Quick aerials can interrupt Sonics movement, mainly N-Air, UAir and B-Air",
        "SecondaryNotes": null,
        "TertiaryNotes": null,
        "Title": "Sonic",
        "Video": "[Dr. Mario vs. Sonic Matchup Playlist](https://www.youtube.com/playlist?list=PLaVVi_TueS9x0vpz9eDqpNIDf6CbYlR_y)",
        "WinningStages": "\r\nSmashville\r\nLylat Cruise\r\nYoshi's Story"
  ***REMOVED***,
    ***REMOVED***
        "Character": "steve",
        "Color": "#B99279",
        "Document": null,
        "LosingStages": "\r\nFinal Destination\r\nBattlefield",
        "NeutralStages": "...",
        "Other": "- Wood stages do not allow him to craft stone, meaning he has to sink 4 iron into his tools or stick with wood unless he crafts diamond/gold\r\n- Stone stages do not allow him to use TNT as freely as most other stages, usually only being able to afford 4-5 a game\r\n- Final Destination and Battlefield/Small Battlefield allow Steve to use a plethora of TNT as much as he wants throughout the game due to the balanced materials",
        "PrimaryNotes": "- Pills are great in neutral, since they can bounce over 1 block high barriers, and possibly over platforms\r\n- Minecart can be reflected for counterpressure and to throw off Steve’s movement\r\n- Try to play more grounded, as Steve gets most damage in from anti-airs\r\n- At ledge, expect Steve to wall you out with grabs and minecart",
        "SecondaryNotes": null,
        "TertiaryNotes": null,
        "Title": "Steve",
        "Video": "[Dr. Mario vs. Steve Matchup Playlist](https://www.youtube.com/playlist?list=PLaVVi_TueS9ypTTdZM7sEjCc56HFwvu-U)",
        "WinningStages": "\r\nYoshi's Story\r\nSmashville\r\nLylat Cruise"
  ***REMOVED***,
    ***REMOVED***
        "Character": "terry",
        "Color": "#EE0000",
        "Document": null,
        "LosingStages": "\r\nFinal Destination\r\nSmall Battlefield\r\nTown & City\r\nKalos",
        "NeutralStages": "...",
        "Other": null,
        "PrimaryNotes": "- Pills are great in neutral, but stay aware of quick burst options like dash attack, crack shoot or buster wolf\r\n- Be wary of Terry’s unique spotdodge attack, so don’t always opt to punish immediately\r\n- Though difficult to react to, try to tilt your shield upwards against Terry’s Power Dunk to evade shield pokes\r\n- After Terry has „Go!“, don’t overshield against Terry as he can break shields easily with Power Geysir\r\n- Reflect Power Wave for free counterpressure\r\n- Respect Terry’s Up B OoS, since it’s range isn’t bad and kills consistently off the top",
        "SecondaryNotes": null,
        "TertiaryNotes": null,
        "Title": "Terry",
        "Video": "[Dr. Mario vs. Terry Matchup Playlist](https://www.youtube.com/playlist?list=PLaVVi_TueS9zmt5ASAAPFSwzwCgwUlvhz)",
        "WinningStages": "\r\nBattlefield\r\nYoshi's Story\r\nLylat Cruise"
  ***REMOVED***,
    ***REMOVED***
        "Character": "toonlink",
        "Color": "#EFEFEF",
        "Document": null,
        "LosingStages": "\r\nBattlefield\r\nTown & City",
        "NeutralStages": "...",
        "Other": null,
        "PrimaryNotes": "- Pills will keep Toon Link busy, and might force Toon Link to jump in against Doc\r\n- Toon Link’s projectiles are slow, so using Cape usually nets you free counterpressure\r\n- Don’t jump in against Toon Link as he will just try to comob you with U-Tilt or hit you with a quick aerial\r\n- Rely on your quick OoS options to punish if he gets too close",
        "SecondaryNotes": null,
        "TertiaryNotes": null,
        "Title": "Toon Link",
        "Video": "[Dr. Mario vs. Toon Link Matchup Playlist](https://www.youtube.com/playlist?list=PLaVVi_TueS9wuBcchhovUiC7yuP5ug0PV)",
        "WinningStages": "\r\nFinal Destination\r\nLylat Cruise"
  ***REMOVED***,
    ***REMOVED***
        "Character": "villager",
        "Color": "#FDA65D",
        "Document": null,
        "LosingStages": "\r\nYoshi's Story\r\nKalos",
        "NeutralStages": "...",
        "Other": null,
        "PrimaryNotes": "- Cape gives Doc a good option to deal with Rockets in neutral; however, don't build your gameplan around Cape\r\n- He has a pretty hard time landing so don't be afraid to juggle him with U-Air\r\n- He's also not very good at close range so try to slowly make your way in\r\n- Villager's also a huge ledge planker, so reflect and shield at the right time\r\n- His recovery is very exploitable and can be covered with Tornado\r\n- Try to move around bowling ball when recovering offstage, or just jump with Cape back to the ledge",
        "SecondaryNotes": null,
        "TertiaryNotes": null,
        "Title": "Villager",
        "Video": "[Dr. Mario vs. Villager Matchup Playlist](https://www.youtube.com/playlist?list=PLaVVi_TueS9yk8ImFtc8zTHw4B83KMzrm)",
        "WinningStages": "\r\nFinal Destination\r\nSmashville\r\nSmall Battlefield"
  ***REMOVED***,
    ***REMOVED***
        "Character": "wario",
        "Color": "#F9D6AA",
        "Document": null,
        "LosingStages": "\r\nSmall Battlefield\r\nSmashville\r\nBattlefield\r\nYoshi's Story",
        "NeutralStages": "...",
        "Other": null,
        "PrimaryNotes": "- Use pills to throw off Wario’s aerial movement or simply to apply pressure while he’s trying to jump in\r\n- Avoid Wario’s combo starters like N-Air or falling U-Air, especially when he has Whaft ready\r\n- Rely on quick OoS options if Wario gets too close\r\n- Pressure Wario with quick aerials like B-Air or U-Air to catch him in the air",
        "SecondaryNotes": null,
        "TertiaryNotes": null,
        "Title": "Wario",
        "Video": "[Dr. Mario vs. Wario Matchup Playlist](https://www.youtube.com/playlist?list=PLaVVi_TueS9wPr0MdVzSO8TmVyuNSVjnZ)",
        "WinningStages": "\r\nFinal Destination\r\nTown & City\r\nPokemon Stadium 2"
  ***REMOVED***,
    ***REMOVED***
        "Character": "wiifittrainer",
        "Color": "#DEDEDE",
        "Document": null,
        "LosingStages": "\r\nKalos\r\nBattlefield\r\nTown & City\r\nYoshi's Story",
        "NeutralStages": "...",
        "Other": null,
        "PrimaryNotes": "- Her hitboxes are weird but mostly punishable on shield\r\n- Mix up your gameplan by shielding her hitboxes or stuffing it out with your own moves such as U-Smash or B-Air\r\n- Don't reflect her ball, go for pill instead to hit it back, or shield it\r\n- You can catch her offguard when she tries to ledgeplank with Side-B by going for Tornado\r\n- Don't get hit by N-Air at lower percents since it can combo into a lot of stuff\r\n- Play more passive and try to keep her away when she has deep breathing activated",
        "SecondaryNotes": null,
        "TertiaryNotes": null,
        "Title": "Wii Fit Trainer",
        "Video": "[Dr. Mario vs. Wii Fit Trainer Matchup Playlist](https://www.youtube.com/playlist?list=PLaVVi_TueS9xGVCH6cjK_cjlUGuAGD5B2)",
        "WinningStages": "\r\nFinal Destination\r\nSmashville"
  ***REMOVED***,
    ***REMOVED***
        "Character": "wolf",
        "Color": "#B1AFCB",
        "Document": null,
        "LosingStages": "\r\nKalos\r\nBattlefield\r\nTown & City\r\nYoshi's Story",
        "NeutralStages": "...",
        "Other": null,
        "PrimaryNotes": "- Respect blaster or reflect it back, it beats practically everything\r\n- Don't pill too often since his Neutral-B can punish us doing so\r\n- Doc should try to stick to his usual gameplan by turtling with shield\r\n- You can contest most of Wolf's moves with caution by using U-Smash or B-Air or other out of shield options\r\n- Avoid getting grabbed from low to mid percents, his combos are pretty strong- Don't try to punish F-Smash unless you're very close to him",
        "SecondaryNotes": null,
        "TertiaryNotes": null,
        "Title": "Wolf",
        "Video": "[Dr. Mario vs. Wolf Matchup Playlist](https://www.youtube.com/playlist?list=PLaVVi_TueS9zxOfRc1LGtTgyEl2G2aKll)",
        "WinningStages": "\r\nFinal Destination\r\nPokemon Stadium 2\r\nSmall Battlefield"
  ***REMOVED***,
    ***REMOVED***
        "Character": "yoshi",
        "Color": "#5DB432",
        "Document": null,
        "LosingStages": "\r\nSmall Battlefield\r\nPokemon Stadium 2\r\nKalos",
        "NeutralStages": "...",
        "Other": "Credits goes to PhDream#2000 for providing these tips! Check the pinned messages in #ultimate-metagame if you want a more in-depth version.",
        "PrimaryNotes": "- Respect Yoshi's shield (Yoshi's OOS game is only as good as it is because of Nair out of shield and he is unable to ever be shield poked)\r\n- Weave in and out with dashes, Empty jumps, tomahawks, etc will help you out with playing around Yoshi's shield and make it less difficult\r\n- Avoid recovering low; try to be as tricky as you can be with using Tornado, your Double Jump, and your Airdodge to avoid any edgeguarding attempts\r\n- Most Yoshi's tend to use Egg Toss to cover the ledge to make reaching it as safe as possible so keep that in mind, don't get frustrated when you can't stop Yoshi from getting to the ledge, it's much safer to ledge trap him than anything",
        "SecondaryNotes": null,
        "TertiaryNotes": null,
        "Title": "Yoshi",
        "Video": "[Dr. Mario vs. Yoshi Matchup Playlist](https://www.youtube.com/playlist?list=PLaVVi_TueS9yiyxtR0voDN5XZUPfC4VuS)",
        "WinningStages": "\r\nSmashville\r\nYoshi's Story\r\nFinal Destination"
  ***REMOVED***,
    ***REMOVED***
        "Character": "younglink",
        "Color": "#00AE44",
        "Document": null,
        "LosingStages": "\r\nKalos\r\nBattlefield\r\nTown & City\r\nYoshi's Story",
        "NeutralStages": "...",
        "Other": null,
        "PrimaryNotes": "- Pills are tricky to use because Yink tries to use his own projectiles as well\r\n- Cape doesn’t deal much damage, but allows you to close in against Yink instead of shielding\r\n- Use quick aerials like N-Air, U-Air or B-Air to catch Yinks movement\r\n- Rely on your OoS once Yink gets too close\r\n- Respect Yinks own N-Air and Up-B OoS",
        "SecondaryNotes": null,
        "TertiaryNotes": null,
        "Title": "Young Link",
        "Video": "[Dr. Mario vs. Young Link Matchup Playlist](https://www.youtube.com/playlist?list=PLaVVi_TueS9yszBcGJ-nkJ6MfUgcOz6W2)",
        "WinningStages": "\r\nBattlefield\r\nYoshi's Story\r\nSmashville"
  ***REMOVED***,
    ***REMOVED***
        "Character": "zelda",
        "Color": "#EFE036",
        "Document": null,
        "LosingStages": "\r\nBattlefield\r\nYoshi's Story\r\nSmashville",
        "NeutralStages": "...",
        "Other": null,
        "PrimaryNotes": "- Pills aren’t great in neutral since Zelda is able to reflect\r\n- Cape is a high risk high reward play as Zelda is able to reflect Phantom as well\r\n- Take as much stage control as possible to neglect Zelda’s gameplan\r\n- Respect Zelda’s F-Air, B-Air & Up B OoS\r\n- Jump ins against Zelda are risky because she has big hitboxes that net high reward\r\n- Avoid overextensions so you don’t lose advantage against Neutral B or a quick aerial",
        "SecondaryNotes": null,
        "TertiaryNotes": null,
        "Title": "Zelda",
        "Video": "[Dr. Mario vs. Zelda Matchup Playlist](https://www.youtube.com/playlist?list=PLaVVi_TueS9w3JUIfv9pUDOv4ZzQMMAgM)",
        "WinningStages": "\r\nFinal Destination\r\nTown & City\r\nKalos"
  ***REMOVED***,
    ***REMOVED***
        "Character": "zerosuitsamus",
        "Color": "#0463D1",
        "Document": null,
        "LosingStages": "\r\nBattlefield\r\nYoshi's Story\r\nKalos\r\nTown & City",
        "NeutralStages": "...",
        "Other": null,
        "PrimaryNotes": "- Pills are useful as long as ZSS doesn’t punish you with Flip Kick\r\n- Rely on quick aerials like N-Air, U-Air or B-Air to catch ZSS in the air\r\n- Movement is more important than shielding, as ZSS jumps around a lot and tries to get yout to make a mistake\r\n- Respect her Up B OoS, especially near the ledge",
        "SecondaryNotes": null,
        "TertiaryNotes": null,
        "Title": "Zero Suit Samus",
        "Video": "[Dr. Mario vs. Zero Suit Samus Matchup Playlist](https://www.youtube.com/playlist?list=PLaVVi_TueS9xhB81fuO35tV9avXxTOC8M)",
        "WinningStages": "\r\nFinal Destination\r\nPokemon Stadium 2\r\nSmall Battlefield"
  ***REMOVED***
]